cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'mas-cli/tap'

brew 'mas-cli/tap/mas'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'openssl'
brew 'node'
brew 'ruby-build'
brew 'rbenv'
brew 'wget'
brew 'git'
brew 'icu4c'
brew 'python'
brew 'htop'
brew 'mysql'
brew 'tig'
brew 'fasd'
brew 'jq'
brew 'spaceman-diff'
brew 'tmux'
brew 'tree'
brew 'docker-machine'
brew 'terraform'

# cask '1password'
# cask 'alfred'
cask 'rectangle'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'iterm2'
cask 'sourcetree'
# cask 'istat-menus'
cask 'docker'
cask 'vagrant'
# cask 'karabiner-elements'
cask 'java'
cask 'mysqlworkbench'
cask 'wireshark'
cask 'visual-studio-code'
cask 'clipy'
cask 'jetbrains-toolbox'
cask 'numi'
cask 'font-fira-code'
